externalBridge/0/include/frontBackPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

/*frontAndBack
{
    type empty;
}*/

emptyFront
{
    type empty;//symmetryPlane;
}

emptyBack
{
    type empty;//symmetryPlane;
}

// ************************************************************************* //
