externalBridge/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    emptyFront
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          86082;
        startFace       171862;
    }
    emptyBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          86082;
        startFace       257944;
    }
    inlet
    {
        type            patch;
        nFaces          134;
        startFace       344026;
    }
    outlet
    {
        type            patch;
        nFaces          134;
        startFace       344160;
    }
    lowerWall
    {
        type            patch;
        nFaces          220;
        startFace       344294;
    }
    upperWall
    {
        type            patch;
        nFaces          220;
        startFace       344514;
    }
    bridge
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1486;
        startFace       344734;
    }
)

// ************************************************************************* //
