externalBridge/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
x1 -60;
x2 -5;
x3 50;
x4 300;
nx 220;
gdx ((55 32 0.2) (55 75 1) (150 90 4.5) (100 23 2));

y1 0;
y2 1;
ny 1;

z1 -60;
z2 -4;
z3 13.4;
z4 69.4;
nz 134;
gdz ((46 42 0.18) (17.4 50 1) (46 42 5.5));

vertices
(
    ($x1 $y2 $z1)
    ($x4 $y2 $z1)
    ($x4 $y2 $z4)
    ($x1 $y2 $z4)
    ($x1 $y1 $z1)
    ($x4 $y1 $z1)
    ($x4 $y1 $z4)
    ($x1 $y1 $z4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $nz $ny) simpleGrading ($gdx $gdz 1)
);

edges
(
);

boundary
(
    emptyFront
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

    emptyBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    lowerWall
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    upperWall
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

// ************************************************************************* //
