externalBridge/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam; //pimpleFoam;//simpleFoam;

startFrom       latestTime; //startTime;//latestTime;

startTime       0;

stopAt          endTime;

endTime         370;

deltaT          0.01; //0.005; //deltaT for pimpleFoam

writeControl    adjustableRunTime; //runTime;//timeStep;

writeInterval   5;

purgeWrite      0;

writeFormat     binary;//ascii; //binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
adjustTimeStep  yes;
maxCo           3;
maxDeltaT	0.01;

functions
{
    #include "streamLines"
    //#include "cuttingPlane"
    #include "forceCoeffs"
    #include "fieldAverage"
    #include "yPlus"
}


// ************************************************************************* //
