externalBridge/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        symGaussSeidel; // //GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
	maxIter         50;
    }
    pFinal
    {
	$p;
	tolerance       1e-8;
	relTol		0;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;  //GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
    UFinal
    {
        $U;
        tolerance       1e-8;
        relTol          0;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;//GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
    kFinal
    {
	$k;
    }

    omega
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;//GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
    omegaFinal
    {
	$omega;
        tolerance       1e-8;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;   // or even 3 if maxNonOrtho is high
    consistent yes;
    residualControl
    {
        p           1e-4;
        U           1e-5;
        "(k|omega)" 1e-5;
    }
}

PIMPLE
{
    nOuterCorrectors 3;      // can increase if needed
    nCorrectors      2;
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|omega)"     1e-5;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.35;    // try 0.2–0.4 if unstable
    }
    equations
    {
        U               0.7;    // try 0.3–0.7; lower = more stable, slower
        k               0.7;
        omega           0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
