externalBridge/system/yPlus
    yPlus
    {
        type        yPlus;
        libs        ("libfieldFunctionObjects.so");
        enabled     true;

        writeControl    writeTime;      // or timeStep, etc.
        //writeInterval   1;

        patches     (bridge);       // <-- your bridge wall patch name
    }